<?php

$students = [
    'ИТ20' => [
        'Николаев Илья' => 4,
        'Королева Елизавета' => 3,
        'Миронова Ярослава' => 3,
        'Савина Валерия' => 5,
        'Артамонов Александр' => 5,
        'Петрова Милана' => 4,
        'Баранов Глеб' => 3,
        'Бобров Егор' => 4,
        'Егорова Дарья' => 4,
        'Калугин Даниил' => 2,
    ],
    'БАП20' => [
        'Денисов Роман' => 3,
        'Зыкова Екатерина' => 5,
        'Комиссаров Михаил' => 4,
        'Носкова Юлия' => 4,
        'Соколов Мирон' => 4,
        'Воробьева Екатерина' => 4,
        'Матвеева Анастасия' => 5,
        'Самойлова Дарья' => 3,
        'Власов Артём' => 2,
        'Соловьев Тимофей' => 3,
    ]
];

$averageRating = [];
    foreach($students as $group => $student) {
        $zero = 0;
        foreach($student as $mark) {
            $zero += $mark;
        }
        $averageRating[$group] = $zero;
    }

echo "Группа с самым большим вычисленным значением успеваемости: " . array_key_first($averageRating);

